namespace DataSA
{
    class DSAMessage
    {
        //什么是算法？
        //算法是用于解决特定问题的一系列的执行步骤。

        //如何评判一个算法的好坏?
        //如果单从执行效率上进行评估,可能会想到这第一种方法
        //比较不同算法对同一组输入的执行处理时间
        //这种方案也叫做:事后统计法

        //上述方案有比较明显的缺点
        //执行时间严重依赖硬件以及运行时各种不确定的环境
        //必须编写相应的测算代码
        //测试数据的选择比较难保证公正性

        //一般从以下维度来评估算法的优劣
        //正确性、可读性、健壮性(对不合理输入的反应能力)
        //时间复杂度(time complexity):估算程序指令的执行次数(执行时间)
        //空间复杂度(space complexity):估算所需占用的存储空间


    }
}
